EMS/Catalogs/EMS_ПараметрыБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>EMS_ПараметрыБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Proxy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SSL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеУзлаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EMS/Catalogs/EMS_ПараметрыБаз/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
 #Область ПрограммныйИнтерфейс
 // Возвращает список актуальных баз.
 // Актуальными считаются элементы справочника EMS_ПараметрыБаз,
 // у которых заполнены КодОрганизации и НаименованиеУзлаИБ.
 //
 // Возвращаемое значение:
 //  Массив из СправочникСсылка.EMS_ПараметрыБаз - массив ссылок на актуальные параметры баз.
 //
 Функция СписокАктуальныхБаз() Экспорт
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	EMS_ПараметрыБаз.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.EMS_ПараметрыБаз КАК EMS_ПараметрыБаз
	 |ГДЕ
	 |	EMS_ПараметрыБаз.КодОрганизации <> """"
	 |	И EMS_ПараметрыБаз.НаименованиеУзлаИБ <> """"";
	 
	 Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
 КонецФункции
 #КонецОбласти
 
 #Область ОбработчикиСобытий
 
 #КонецОбласти
 
 #Область СлужебныйПрограммныйИнтерфейс
 
 #КонецОбласти
 
 #Область СлужебныеПроцедурыИФункции
 
 #КонецОбласти
 
 #КонецЕсли
